# Cloud CLI
brew "azure-cli"
#brew "gcloud-cli"

# DevOps & Infrastructure
brew "terraform"
brew "ansible"
brew "kubectl"
brew "k9s"
brew "kubectx"
brew "helm"

# Modern Shell Tools
brew "fzf"
brew "tldr"

# Core Utilities
brew "git"
brew "htop"
brew "jq"
brew "stow"
brew "wget"

# Languages & Runtimes
brew "python"
brew "go"
brew "pipx"
brew "node"
brew "nvm"

# Container Runtime (Colima instead of Docker Desktop)
brew "docker"
brew "docker-compose"

# GUI Applications
cask "rectangle"
cask "shottr"
cask "caffeine"

# Fonts
cask "font-jetbrains-mono-nerd-font"