# Cloud CLI
brew "awscli"
brew "azure-cli"
#brew "gcloud-cli"

# DevOps & Infrastructure
brew "terraform"
brew "ansible"
brew "kubectl"
brew "k9s"
brew "kubectx"
brew "helm"

# Modern Shell Tools
brew "starship"
brew "zoxide"
brew "eza"
brew "bat"
brew "ripgrep"
brew "fzf"
brew "delta"
brew "lazygit"
brew "tldr"

# Core Utilities
brew "git"
brew "gh"
brew "htop"
brew "jq"
brew "yq"
brew "stow"
brew "tmux"
brew "wget"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# Languages & Runtimes
brew "python"
brew "pipx"
brew "node"
brew "nvm"

# Container Runtime (Colima instead of Docker Desktop)
brew "docker"
brew "docker-compose"
brew "colima"

# GUI Applications
cask "ghostty"
cask "rectangle"
cask "shottr"
cask "caffeine"

# Fonts
cask "font-jetbrains-mono-nerd-font"